modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
        <register>
          <name>RISC_RCFGLOCKR1</name>
          <description>RIFSC RISC slave resource configuration lock register x</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RLOCK0</name>
              <description>Resource lock for peripheral 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK1</name>
              <description>Resource lock for peripheral 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK2</name>
              <description>Resource lock for peripheral 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK3</name>
              <description>Resource lock for peripheral 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK4</name>
              <description>Resource lock for peripheral 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK5</name>
              <description>Resource lock for peripheral 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK6</name>
              <description>Resource lock for peripheral 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK7</name>
              <description>Resource lock for peripheral 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK8</name>
              <description>Resource lock for peripheral 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK9</name>
              <description>Resource lock for peripheral 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK10</name>
              <description>Resource lock for peripheral 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK11</name>
              <description>Resource lock for peripheral 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK12</name>
              <description>Resource lock for peripheral 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK13</name>
              <description>Resource lock for peripheral 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK14</name>
              <description>Resource lock for peripheral 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK15</name>
              <description>Resource lock for peripheral 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK16</name>
              <description>Resource lock for peripheral 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK17</name>
              <description>Resource lock for peripheral 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK18</name>
              <description>Resource lock for peripheral 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK19</name>
              <description>Resource lock for peripheral 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK20</name>
              <description>Resource lock for peripheral 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK21</name>
              <description>Resource lock for peripheral 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK22</name>
              <description>Resource lock for peripheral 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK23</name>
              <description>Resource lock for peripheral 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK24</name>
              <description>Resource lock for peripheral 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK25</name>
              <description>Resource lock for peripheral 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK26</name>
              <description>Resource lock for peripheral 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK27</name>
              <description>Resource lock for peripheral 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK28</name>
              <description>Resource lock for peripheral 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK29</name>
              <description>Resource lock for peripheral 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK30</name>
              <description>Resource lock for peripheral 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK31</name>
              <description>Resource lock for peripheral 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RISC_RCFGLOCKR2</name>
          <description>RIFSC RISC slave resource configuration lock register x</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RLOCK0</name>
              <description>Resource lock for peripheral 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK1</name>
              <description>Resource lock for peripheral 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK2</name>
              <description>Resource lock for peripheral 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK3</name>
              <description>Resource lock for peripheral 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK4</name>
              <description>Resource lock for peripheral 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK5</name>
              <description>Resource lock for peripheral 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK6</name>
              <description>Resource lock for peripheral 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK7</name>
              <description>Resource lock for peripheral 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK8</name>
              <description>Resource lock for peripheral 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK9</name>
              <description>Resource lock for peripheral 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK10</name>
              <description>Resource lock for peripheral 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK11</name>
              <description>Resource lock for peripheral 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK12</name>
              <description>Resource lock for peripheral 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK13</name>
              <description>Resource lock for peripheral 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK14</name>
              <description>Resource lock for peripheral 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK15</name>
              <description>Resource lock for peripheral 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK16</name>
              <description>Resource lock for peripheral 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK17</name>
              <description>Resource lock for peripheral 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK18</name>
              <description>Resource lock for peripheral 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK19</name>
              <description>Resource lock for peripheral 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK20</name>
              <description>Resource lock for peripheral 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK21</name>
              <description>Resource lock for peripheral 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK22</name>
              <description>Resource lock for peripheral 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK23</name>
              <description>Resource lock for peripheral 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK24</name>
              <description>Resource lock for peripheral 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK25</name>
              <description>Resource lock for peripheral 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK26</name>
              <description>Resource lock for peripheral 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK27</name>
              <description>Resource lock for peripheral 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK28</name>
              <description>Resource lock for peripheral 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK29</name>
              <description>Resource lock for peripheral 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK30</name>
              <description>Resource lock for peripheral 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK31</name>
              <description>Resource lock for peripheral 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RISC_RCFGLOCKR3</name>
          <description>RIFSC RISC slave resource configuration lock register x</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RLOCK0</name>
              <description>Resource lock for peripheral 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK1</name>
              <description>Resource lock for peripheral 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK2</name>
              <description>Resource lock for peripheral 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK3</name>
              <description>Resource lock for peripheral 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK4</name>
              <description>Resource lock for peripheral 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK5</name>
              <description>Resource lock for peripheral 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK6</name>
              <description>Resource lock for peripheral 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK7</name>
              <description>Resource lock for peripheral 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK8</name>
              <description>Resource lock for peripheral 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK9</name>
              <description>Resource lock for peripheral 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK10</name>
              <description>Resource lock for peripheral 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK11</name>
              <description>Resource lock for peripheral 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK12</name>
              <description>Resource lock for peripheral 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK13</name>
              <description>Resource lock for peripheral 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK14</name>
              <description>Resource lock for peripheral 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK15</name>
              <description>Resource lock for peripheral 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK16</name>
              <description>Resource lock for peripheral 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK17</name>
              <description>Resource lock for peripheral 17</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK18</name>
              <description>Resource lock for peripheral 18</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK19</name>
              <description>Resource lock for peripheral 19</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK20</name>
              <description>Resource lock for peripheral 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK21</name>
              <description>Resource lock for peripheral 21</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK22</name>
              <description>Resource lock for peripheral 22</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK23</name>
              <description>Resource lock for peripheral 23</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK24</name>
              <description>Resource lock for peripheral 24</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK25</name>
              <description>Resource lock for peripheral 25</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK26</name>
              <description>Resource lock for peripheral 26</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK27</name>
              <description>Resource lock for peripheral 27</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK28</name>
              <description>Resource lock for peripheral 28</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK29</name>
              <description>Resource lock for peripheral 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK30</name>
              <description>Resource lock for peripheral 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RLOCK31</name>
              <description>Resource lock for peripheral 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
