modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
        <register>
          <name>RIMC_ATTR8</name>
          <description>RIFSC RIMC master attribute register x</description>
          <addressOffset>0xc30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCID</name>
              <description>Master CID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RIMC_ATTR9</name>
          <description>RIFSC RIMC master attribute register x</description>
          <addressOffset>0xc34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCID</name>
              <description>Master CID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RIMC_ATTR10</name>
          <description>RIFSC RIMC master attribute register x</description>
          <addressOffset>0xc38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCID</name>
              <description>Master CID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RIMC_ATTR11</name>
          <description>RIFSC RIMC master attribute register x</description>
          <addressOffset>0xc3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCID</name>
              <description>Master CID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RIMC_ATTR12</name>
          <description>RIFSC RIMC master attribute register x</description>
          <addressOffset>0xc40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MCID</name>
              <description>Master CID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MSEC</name>
              <description>Master secure</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MPRIV</name>
              <description>Master privileged</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PPSR0</name>
          <description>RIFSC peripheral protection status register x</description>
          <addressOffset>0xfb0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PPSR1</name>
          <description>RIFSC peripheral protection status register x</description>
          <addressOffset>0xfb4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PPSR2</name>
          <description>RIFSC peripheral protection status register x</description>
          <addressOffset>0xfb8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PPSR3</name>
          <description>RIFSC peripheral protection status register x</description>
          <addressOffset>0xfbc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PPSR4</name>
          <description>RIFSC peripheral protection status register x</description>
          <addressOffset>0xfc0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PPSR5</name>
          <description>RIFSC peripheral protection status register x</description>
          <addressOffset>0xfc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
