modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
        <register>
          <name>CIDCFGR6</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR6</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR6</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR6</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR6</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR6</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR6</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR6</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR6</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR7</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR7</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x204</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR7</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR7</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x20c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR7</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR7</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR7</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR7</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x21c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR7</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR7</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR7</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR7</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR8</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR8</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR8</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR8</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR8</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR8</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR8</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR8</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x25c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR8</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR8</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR8</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR8</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x26c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR9</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR9</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR9</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR9</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x28c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR9</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR9</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR9</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR9</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x29c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR9</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR9</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR9</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR9</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR10</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR10</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR10</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR10</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR10</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR10</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR10</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR10</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR10</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR10</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR10</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR10</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR11</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x300</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR11</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x304</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR11</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x308</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR11</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x30c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR11</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR11</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR11</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR11</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x31c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR11</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR11</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR11</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR11</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x32c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR12</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x340</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR12</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x344</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR12</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x348</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR12</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x34c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR12</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x350</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR12</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x354</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR12</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x358</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR12</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x35c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR12</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BSTARTR12</name>
          <description>RISAF Region X subregion B start address register</description>
          <addressOffset>0x364</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BENDR12</name>
          <description>RISAF Region X subregion B end address register</description>
          <addressOffset>0x368</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BNESTR12</name>
          <description>RISAF Region X subregion B nested mode register</description>
          <addressOffset>0x36c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CFGR13</name>
          <description>RISAF Region X configuration register</description>
          <addressOffset>0x380</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>STARTR13</name>
          <description>RISAF Region X start address register</description>
          <addressOffset>0x384</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ENDR13</name>
          <description>RISAF Region X end address register</description>
          <addressOffset>0x388</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>CIDCFGR13</name>
          <description>RISAF Region X CID configuration register</description>
          <addressOffset>0x38c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ACFGR13</name>
          <description>RISAF Region X subregion A configuration register</description>
          <addressOffset>0x390</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ASTARTR13</name>
          <description>RISAF Region X subregion A start address register</description>
          <addressOffset>0x394</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>AENDR13</name>
          <description>RISAF Region X subregion A end address register</description>
          <addressOffset>0x398</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ANESTR13</name>
          <description>RISAF Region X subregion A nested mode register</description>
          <addressOffset>0x39c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>BCFGR13</name>
          <description>RISAF Region X subregion B configuration register</description>
          <addressOffset>0x3a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
