modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <groupName>IWDG</groupName>
      <baseAddress>0x46004800</baseAddress>
      <interrupt>
        <name>IWDG</name>
        <description>Internal Watchdog interrupt</description>
        <value>18</value>
      </interrupt>
      <registers>
        <register>
          <name>KR</name>
          <description>IWDG key register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key value (write only, read 0x0000)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>IWDG prescaler register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PR</name>
              <description>Prescaler divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <description>IWDG reload register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RL</name>
              <description>Watchdog counter reload value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>IWDG status register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WVU</name>
              <description>Watchdog counter window value update</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWU</name>
              <description>Watchdog interrupt comparator value update</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ONF</name>
              <description>Watchdog Enable status bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWIF</name>
              <description>Watchdog Early Interrupt flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINR</name>
          <description>IWDG window register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIN</name>
              <description>Watchdog counter window value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EWCR</name>
          <description>IWDG early wakeup interrupt register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EWIT</name>
              <description>Watchdog counter window value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>EWIE</name>
              <description>Watchdog early interrupt enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>IWDG interrupt clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EWIC</name>
              <description>Watchdog early interrupt acknowledge</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x46008000</baseAddress>
      <registers>
        <register>
          <name>BOOTCR</name>
          <description>SYSCFG boot pin control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOT0_PD</name>
              <description>BOOT0 pin pull-down disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BOOT1_PD</name>
              <description>BOOT1 pin pull-down disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM55CR</name>
          <description>SYSCFG Cortex-M55 control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FPU_IT_EN</name>
              <description>Enable FPU exception</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>LOCKSVTAIRCR</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKNSVTOR</name>
              <description>Prevent changes to the non-secure vector table base address</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKSMPU</name>
              <description>Prevent changes to programmed secure MPU memory regions</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKNSMPU</name>
              <description>Prevent changes to programmed non-secure MPU memory regions</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKSAU</name>
              <description>Prevent changes to secure SAU memory regions already programmed</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKDCAIC</name>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM55TCMCR</name>
          <description>SYSCFG Cortex-M55 TCM control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CFGITCMSZ</name>
              <description>Select ITCM memory size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CFGDTCMSZ</name>
              <description>Select DTCM memory size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>LOCKTCM</name>
              <description>Disable writes to registers associated with the TCM region</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKITGU</name>
              <description>Disable writes to registers associated with the ITCM interface security/gating</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKDTGU</name>
              <description>Disable writes to registers associated with the DTCM interface security/gating</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITCMWSDISABLE</name>
              <description>Disable wait-state applied by default on extended ITCM memory</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTCMWSDISABLE</name>
              <description>Disable wait-state applied by default on extended DTCM memory</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM55RWMCR</name>
          <description>SYSCFG Cortex-M55 memory RW margin register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RME_TCM</name>
              <description>RW margin enable input for TCM memories</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RM_TCM</name>
              <description>External RW margin inputs for TCM memories</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BC1_TCM</name>
              <description>Biasing level adjust input recommended for Vnom</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BC2_TCM</name>
              <description>Biasing level adjust input recommended for Vnom + 10%</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RME_CACHE</name>
              <description>RW margin enable input for caches memories</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RM_CACHE</name>
              <description>External read/write (RW) margin inputs for caches memories</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>BC1_CACHE</name>
              <description>Biasing level adjust input recommended for Vnom</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BC2_CACHE</name>
              <description>Biasing level adjust input recommended for Vnom + 10%</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INITSVTORCR</name>
          <description>SYSCFG Cortex-M55 SVTOR control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SVTOR_ADDR</name>
              <description>Secure vector table base address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INITNSVTORCR</name>
          <description>Cortex-M55 NSVTOR control register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>NSVTOR_ADDR</name>
              <description>Non-Secure vector table base address</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM55RSTCR</name>
          <description>SYSCFG Cortex-M55 reset type control register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CORE_RESET_TYPE</name>
              <description>Select reset to apply on core upon SYSRESETREQ</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKUP_RST_EN</name>
              <description>Select action to perform on a lockup state on the core</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKUP_NMI_EN</name>
              <description>Select action to perform on a lockup state on the core</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CM55PAHBWPR</name>
          <description>SYSCFG Cortex-M55 P-AHB write posting control register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAHB_ERROR_ACK</name>
              <description>Error capture in write posting buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VENCRAMCR</name>
          <description>SYSCFG VENCRAM control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VENCRAM_EN</name>
              <description>VENCRAM allocation VENC if active, or to system (if VENC inactive)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>POTTAMPRSTCR</name>
          <description>SYSCFG potential tamper reset register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POTTAMPERSETMASK</name>
              <description>mask PKA, SAES, CRYP1/2, and HASH reset, in case of potential tamper</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICNEWRCR</name>
          <description>SYSCFG AHB-AXI bridge early write response</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDMMC1_EARLY_WR_RSP_ENABLE</name>
              <description>SDMMC1 early-write response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDMMC2_EARLY_WR_RSP_ENABLE</name>
              <description>SDMMC2 early-write response</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB1_EARLY_WR_RSP_ENABLE</name>
              <description>USB1 early-write response</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB2_EARLY_WR_RSP_ENABLE</name>
              <description>USB2 early-write response</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICNCGCR</name>
          <description>SYSCFG ICN clock gating control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPU_NIC_CG_DISABLE</name>
              <description>CPU_NIC clock gating disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CPU_NOC_CG_DISABLE</name>
              <description>CPU_NOC clock gating disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDIO4CCCR</name>
          <description>SYSCFG VDDIO4 compensation cell control register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RANSRC</name>
              <description>I/O compensation code for NMOS transistors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RAPSRC</name>
              <description>I/O compensation code for PMOS transistors</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>Enables the compensation cell of I/Os supplied by VDDIO4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>Code selection for the compensation cell of I/Os supplied by VDDIO4</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDIO4CCSR</name>
          <description>SYSCFG VDDIO4 compensation cell status register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANSRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>APSRC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>READY</name>
              <description>Provides the compensation cell status of I/Os supplied by VDDIO4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDIO5CCCR</name>
          <description>SYSCFG VDDIO5 compensation cell control register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RANSRC</name>
              <description>I/O compensation code for NMOS transistors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RAPSRC</name>
              <description>I/O compensation code for PMOS transistors</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>Enables the compensation cell of I/Os supplied by VDDIO5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>Code selection for the compensation cell of I/Os supplied by VDDIO5</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDIO5CCSR</name>
          <description>SYSCFG VDDIO5 compensation cell status register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANSRC</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>APSRC</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>READY</name>
              <description>Provides the compensation cell status of I/Os supplied by VDDIO5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VDDIO2CCCR</name>
          <description>SYSCFG VDDIO2 compensation cell control register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RANSRC</name>
              <description>I/O compensation code for NMOS transistors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RAPSRC</name>
              <description>I/O compensation code for PMOS transistors</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>EN</name>
              <description>Enables the compensation cell of I/Os supplied by VDDIO2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>Code selection for the compensation cell of I/Os supplied by VDDIO2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
