modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
        <register>
          <name>SWLOCK10</name>
          <description>BSEC sticky write lock register (0-11)</description>
          <addressOffset>0x868</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SWLOCK0</name>
              <description>Sticky write lock for shadow register (32 x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK1</name>
              <description>Sticky write lock for shadow register (1+32 x)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK2</name>
              <description>Sticky write lock for shadow register (2+32 x)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK3</name>
              <description>Sticky write lock for shadow register (3+32 x)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK4</name>
              <description>Sticky write lock for shadow register (4+32 x)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK5</name>
              <description>Sticky write lock for shadow register (5+32 x)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK6</name>
              <description>Sticky write lock for shadow register (6+32 x)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK7</name>
              <description>Sticky write lock for shadow register (7+32 x)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK8</name>
              <description>Sticky write lock for shadow register (8+32 x)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK9</name>
              <description>Sticky write lock for shadow register (9+32 x)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK10</name>
              <description>Sticky write lock for shadow register (10+32 x)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK11</name>
              <description>Sticky write lock for shadow register (11+32 x)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK12</name>
              <description>Sticky write lock for shadow register (12+32 x)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK13</name>
              <description>Sticky write lock for shadow register (13+32 x)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK14</name>
              <description>Sticky write lock for shadow register (14+32 x)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK15</name>
              <description>Sticky write lock for shadow register (15+32 x)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK16</name>
              <description>Sticky write lock for shadow register (16+32 x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK17</name>
              <description>Sticky write lock for shadow register (17+32 x)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK18</name>
              <description>Sticky write lock for shadow register (18+32 x)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK19</name>
              <description>Sticky write lock for shadow register (19+32 x)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK20</name>
              <description>Sticky write lock for shadow register (20+32 x)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK21</name>
              <description>Sticky write lock for shadow register (21+32 x)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK22</name>
              <description>Sticky write lock for shadow register (22+32 x)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK23</name>
              <description>Sticky write lock for shadow register (23+32 x)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK24</name>
              <description>Sticky write lock for shadow register (24+32 x)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK25</name>
              <description>Sticky write lock for shadow register (25+32 x)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK26</name>
              <description>Sticky write lock for shadow register (26+32 x)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK27</name>
              <description>Sticky write lock for shadow register (27+32 x)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK28</name>
              <description>Sticky write lock for shadow register (28+32 x)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK29</name>
              <description>Sticky write lock for shadow register (29+32 x)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK30</name>
              <description>Sticky write lock for shadow register (30+32 x)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK31</name>
              <description>Sticky write lock for shadow register (31+32 x)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWLOCK11</name>
          <description>BSEC sticky write lock register (0-11)</description>
          <addressOffset>0x86c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SWLOCK0</name>
              <description>Sticky write lock for shadow register (32 x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK1</name>
              <description>Sticky write lock for shadow register (1+32 x)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK2</name>
              <description>Sticky write lock for shadow register (2+32 x)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK3</name>
              <description>Sticky write lock for shadow register (3+32 x)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK4</name>
              <description>Sticky write lock for shadow register (4+32 x)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK5</name>
              <description>Sticky write lock for shadow register (5+32 x)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK6</name>
              <description>Sticky write lock for shadow register (6+32 x)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK7</name>
              <description>Sticky write lock for shadow register (7+32 x)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK8</name>
              <description>Sticky write lock for shadow register (8+32 x)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK9</name>
              <description>Sticky write lock for shadow register (9+32 x)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK10</name>
              <description>Sticky write lock for shadow register (10+32 x)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK11</name>
              <description>Sticky write lock for shadow register (11+32 x)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK12</name>
              <description>Sticky write lock for shadow register (12+32 x)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK13</name>
              <description>Sticky write lock for shadow register (13+32 x)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK14</name>
              <description>Sticky write lock for shadow register (14+32 x)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK15</name>
              <description>Sticky write lock for shadow register (15+32 x)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK16</name>
              <description>Sticky write lock for shadow register (16+32 x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK17</name>
              <description>Sticky write lock for shadow register (17+32 x)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK18</name>
              <description>Sticky write lock for shadow register (18+32 x)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK19</name>
              <description>Sticky write lock for shadow register (19+32 x)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK20</name>
              <description>Sticky write lock for shadow register (20+32 x)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK21</name>
              <description>Sticky write lock for shadow register (21+32 x)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK22</name>
              <description>Sticky write lock for shadow register (22+32 x)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK23</name>
              <description>Sticky write lock for shadow register (23+32 x)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK24</name>
              <description>Sticky write lock for shadow register (24+32 x)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK25</name>
              <description>Sticky write lock for shadow register (25+32 x)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK26</name>
              <description>Sticky write lock for shadow register (26+32 x)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK27</name>
              <description>Sticky write lock for shadow register (27+32 x)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK28</name>
              <description>Sticky write lock for shadow register (28+32 x)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK29</name>
              <description>Sticky write lock for shadow register (29+32 x)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK30</name>
              <description>Sticky write lock for shadow register (30+32 x)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWLOCK31</name>
              <description>Sticky write lock for shadow register (31+32 x)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SRLOCK0</name>
          <description>BSEC sticky reload lock register (0-11)</description>
          <addressOffset>0x880</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRLOCK0</name>
              <description>Sticky reload lock for fuse word (32 x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK1</name>
              <description>Sticky reload lock for fuse word (1+32 x)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK2</name>
              <description>Sticky reload lock for fuse word (2+32 x)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK3</name>
              <description>Sticky reload lock for fuse word (3+32 x)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK4</name>
              <description>Sticky reload lock for fuse word (4+32 x)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK5</name>
              <description>Sticky reload lock for fuse word (5+32 x)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK6</name>
              <description>Sticky reload lock for fuse word (6+32 x)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK7</name>
              <description>Sticky reload lock for fuse word (7+32 x)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK8</name>
              <description>Sticky reload lock for fuse word (8+32 x)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK9</name>
              <description>Sticky reload lock for fuse word (9+32 x)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK10</name>
              <description>Sticky reload lock for fuse word (10+2 x)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK11</name>
              <description>Sticky reload lock for fuse word (11+32 x)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK12</name>
              <description>Sticky reload lock for fuse word (12+32 x)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK13</name>
              <description>Sticky reload lock for fuse word (13+32 x)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK14</name>
              <description>Sticky reload lock for fuse word (14+32 x)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK15</name>
              <description>Sticky reload lock for fuse word (15+32 x)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK16</name>
              <description>Sticky reload lock for fuse word (16+32 x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK17</name>
              <description>Sticky reload lock for fuse word (17+32 x)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK18</name>
              <description>Sticky reload lock for fuse word (18+32 x)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK19</name>
              <description>Sticky reload lock for fuse word (19+32 x)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK20</name>
              <description>Sticky reload lock for fuse word (20+32 x)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK21</name>
              <description>Sticky reload lock for fuse word (21+32 x)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK22</name>
              <description>Sticky reload lock for fuse word (22+32 x)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK23</name>
              <description>Sticky reload lock for fuse word (23+32 x)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK24</name>
              <description>Sticky reload lock for fuse word (24+32 x)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK25</name>
              <description>Sticky reload lock for fuse word (25+32 x)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK26</name>
              <description>Sticky reload lock for fuse word (26+32 x)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK27</name>
              <description>Sticky reload lock for fuse word (27+32 x)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK28</name>
              <description>Sticky reload lock for fuse word (28+32 x)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK29</name>
              <description>Sticky reload lock for fuse word (29+32 x)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK30</name>
              <description>Sticky reload lock for fuse word (30+32 x)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRLOCK31</name>
              <description>Sticky reload lock for fuse word (31+32 x)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
