modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
        <register>
          <name>TSHILORESETR0</name>
          <description>DTS TSx High/Low Reset Register</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_LO_SET</name>
              <description>TS Sample Low Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPL_HI_CLR</name>
              <description>TS Sample high clear 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_IER1</name>
          <description>DTS TSx IRQ Enable Register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ_EN_FAULT</name>
              <description>TS Fault IRQ enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_EN_DONE</name>
              <description>TS Sample done IRQ enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_EN_ALARMA</name>
              <description>TS Alarm A IRQ enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_EN_ALARMB</name>
              <description>TS Alarm B IRQ enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_ISR1</name>
          <description>DTS TSx IRQ Status Register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TS0_IRQ_STATUS</name>
              <description>TS0 IRQ status after masking</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TS1_IRQ_STATUS</name>
              <description>TS1 IRQ status after masking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_STATUS_ALARMA</name>
              <description>TS Alarm A IRQ status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_STATUS_ALARMB</name>
              <description>TS Alarm B IRQ status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TS_ICR1</name>
          <description>DTS TSx IRQ Clear Register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ_CLEAR_FAULT</name>
              <description>TS Fault IRQ clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_CLEAR_DONE</name>
              <description>TS Sample done IRQ clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_CLEAR_ALARMA</name>
              <description>TS Alarm A IRQ clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_CLEAR_ALARMB</name>
              <description>TS Alarm B IRQ clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSIRQTESTR1</name>
          <description>DTS TSx IRQ Test Register</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IRQ_TEST_FAULT</name>
              <description>TS Fault IRQ test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_TEST_DONE</name>
              <description>TS Sample done IRQ test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_TEST_ALARMA</name>
              <description>TS Alarm A IRQ test</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ_TEST_ALARMB</name>
              <description>TS Alarm B IRQ test</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSDIFRDATAR1</name>
          <description>DTS TSx SDIF RDATA Register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_RDATA</name>
              <description>TS SDIF read data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSDIFDONER1</name>
          <description>DTS TSx SDIF Done Register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDIF_SMPL_DONE</name>
              <description>TS Sample done flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSDIFDATAR1</name>
          <description>DTS TSx SDIF Data Register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SAMPLE_DATA</name>
              <description>TS Sample data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>SAMPLE_TYPE</name>
              <description>TS Sample type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAMPLE_FAULT</name>
              <description>TS Sample fault</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSALARMA_CFGR1</name>
          <description>DTS TSx Alarm A Configuration Register</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYSTA_THRESH</name>
              <description>TS Alarm A hysteresis threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ALARMA_THRESH</name>
              <description>TS Alarm A threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSALARMB_CFGR1</name>
          <description>DTS TSx Alarm B Configuration Register</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYSTB_THRESH</name>
              <description>TS Alarm B hysteresis threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>ALARMB_THRESH</name>
              <description>TS Alarm B threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHLSAMPLER1</name>
          <description>DTS TSx High/Low Sample Register</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_LO</name>
              <description>TS Lowest valid data sample value received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>SMPL_HI</name>
              <description>TS Highest valid data sample value received</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHILORESETR1</name>
          <description>DTS TSx High/Low Reset Register</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMPL_LO_SET</name>
              <description>TS Sample Low Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPL_HI_CLR</name>
              <description>TS Sample high clear 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
