modm-ext/data.modm.io/docs/svd/header_stm32n645xx.svd
        <register>
          <name>PRIVCFGR3</name>
          <description>RCC system privilege configuration register 3</description>
          <addressOffset>0x7b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODPRIV</name>
              <description>Privileged protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPRIV</name>
              <description>Privileged protection of SYS system configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPRIV</name>
              <description>Privileged protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPRIV</name>
              <description>Privileged protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPRIV</name>
              <description>Privileged protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPRIV</name>
              <description>Privileged protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR3</name>
          <description>RCC system lock configuration register 3</description>
          <addressOffset>0x7b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODLOCK</name>
              <description>Locked protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSLOCK</name>
              <description>Locked protection of SYS system configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSLOCK</name>
              <description>Locked protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERLOCK</name>
              <description>Locked protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTLOCK</name>
              <description>Locked protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTLOCK</name>
              <description>Locked protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR3</name>
          <description>RCC system public configuration register 3</description>
          <addressOffset>0x7bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODPUB</name>
              <description>Public protection of MOD system configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSPUB</name>
              <description>Public protection of SYS system configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSPUB</name>
              <description>Public protection of BUS system configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERPUB</name>
              <description>Public protection of PER system configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INTPUB</name>
              <description>Public protection of INT system configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTPUB</name>
              <description>Public protection of RST system configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECCFGR4</name>
          <description>RCC bus secure configuration register 4</description>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACLKNSEC</name>
              <description>Secure protection of ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCSEC</name>
              <description>Secure protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMSEC</name>
              <description>Secure protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1SEC</name>
              <description>Secure protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2SEC</name>
              <description>Secure protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3SEC</name>
              <description>Secure protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4SEC</name>
              <description>Secure protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5SEC</name>
              <description>Secure protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1SEC</name>
              <description>Secure protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2SEC</name>
              <description>Secure protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3SEC</name>
              <description>Secure protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4SEC</name>
              <description>Secure protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5SEC</name>
              <description>Secure protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCSEC</name>
              <description>Secure protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVCFGR4</name>
          <description>RCC bus privilege configuration register 4</description>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACLKNPRIV</name>
              <description>Privileged protection of ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPRIV</name>
              <description>Privileged protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPRIV</name>
              <description>Privileged protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PRIV</name>
              <description>Privileged protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PRIV</name>
              <description>Privileged protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PRIV</name>
              <description>Privileged protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PRIV</name>
              <description>Privileged protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PRIV</name>
              <description>Privileged protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PRIV</name>
              <description>Privileged protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PRIV</name>
              <description>Privileged protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PRIV</name>
              <description>Privileged protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PRIV</name>
              <description>Privileged protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PRIV</name>
              <description>Privileged protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPRIV</name>
              <description>Privileged protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCFGR4</name>
          <description>RCC bus lock configuration register 4</description>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACLKNLOCK</name>
              <description>Locked protection of ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCLOCK</name>
              <description>Locked protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMLOCK</name>
              <description>Locked protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1LOCK</name>
              <description>Locked protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2LOCK</name>
              <description>Locked protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3LOCK</name>
              <description>Locked protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4LOCK</name>
              <description>Locked protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5LOCK</name>
              <description>Locked protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1LOCK</name>
              <description>Locked protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2LOCK</name>
              <description>Locked protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3LOCK</name>
              <description>Locked protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4LOCK</name>
              <description>Locked protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5LOCK</name>
              <description>Locked protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCLOCK</name>
              <description>Locked protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR4</name>
          <description>RCC bus public configuration register 4</description>
          <addressOffset>0x7cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACLKNPUB</name>
              <description>Public protection of the ACLKN bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACLKNCPUB</name>
              <description>Public protection of ACLKNC bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBMPUB</name>
              <description>Public protection of AHBM bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB1PUB</name>
              <description>Public protection of AHB1 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB2PUB</name>
              <description>Public protection of AHB2 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB3PUB</name>
              <description>Public protection of AHB3 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB4PUB</name>
              <description>Public protection of AHB4 bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHB5PUB</name>
              <description>Public protection of AHB5 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB1PUB</name>
              <description>Public protection of APB1 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB2PUB</name>
              <description>Public protection of APB2 bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB3PUB</name>
              <description>Public protection of APB3 bus configuration bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB4PUB</name>
              <description>Public protection of APB4 bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>APB5PUB</name>
              <description>Public protection of APB5 bus configuration bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NOCPUB</name>
              <description>Public protection of NOC bus configuration bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBCFGR5</name>
          <description>RCC bus public configuration register 4</description>
          <addressOffset>0x7d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AXISRAM3PUB</name>
              <description>Public protection of AXISRAM3 bus configuration bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM4PUB</name>
              <description>Public protection of AXISRAM4 bus configuration bits</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM5PUB</name>
              <description>Public protection of AXISRAM5 bus configuration bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM6PUB</name>
              <description>Public protection of AXISRAM6 bus configuration bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM1PUB</name>
              <description>Public protection of AHBSRAM1 bus configuration bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBSRAM2PUB</name>
              <description>Public protection of AHBSRAM2 bus configuration bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPSRAMPUB</name>
              <description>Public protection of BKPSRAM bus configuration bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM1PUB</name>
              <description>Public protection of AXISRAM1 bus configuration bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AXISRAM2PUB</name>
              <description>Public protection of AXISRAM2 bus configuration bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLEXRAMPUB</name>
              <description>Public protection of FLEXRAM bus configuration bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VENCRAMPUB</name>
              <description>Public protection of VENCRAM bus configuration bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
